---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.Dispose
source: html/d1ec6b05-f29c-be9c-2bd4-cd3c18491937.htm
---
# Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings.Dispose Method

Releases all resources used by the DirectContext3DHandleSettings

## Syntax (C#)
```csharp
public void Dispose()
```